0/dependency-graph.mmd
flowchart LR
  n_stonebranch_PROD_agent_machine01["stonebranch/PROD/agent: machine01"]
  n_stonebranch_PROD_calendar_BUSINESS_DAYS["stonebranch/PROD/calendar: BUSINESS_DAYS"]
  n_stonebranch_PROD_command_839f31339ca67757["stonebranch/PROD/command: 839f31339ca67757"]
  n_stonebranch_PROD_command_abe08ff03ed79b2a["stonebranch/PROD/command: abe08ff03ed79b2a"]
  n_stonebranch_PROD_credential_CRED_APP["stonebranch/PROD/credential: CRED_APP"]
  n_stonebranch_PROD_task_JOB_A["stonebranch/PROD/task: JOB_A"]
  n_stonebranch_PROD_task_JOB_B["stonebranch/PROD/task: JOB_B"]
  n_stonebranch_PROD_trigger_TRG_JOB_A["stonebranch/PROD/trigger: TRG_JOB_A"]
  n_stonebranch_PROD_variable_RUN_DATE["stonebranch/PROD/variable: RUN_DATE"]
  n_stonebranch_PROD_task_JOB_B -->|runs_command| n_stonebranch_PROD_command_abe08ff03ed79b2a
  n_stonebranch_PROD_task_JOB_A -->|runs_on| n_stonebranch_PROD_agent_machine01
  n_stonebranch_PROD_task_JOB_A -->|uses_credential| n_stonebranch_PROD_credential_CRED_APP
  n_stonebranch_PROD_task_JOB_B -->|runs_on| n_stonebranch_PROD_agent_machine01
  n_stonebranch_PROD_task_JOB_A -->|uses_variable| n_stonebranch_PROD_variable_RUN_DATE
  n_stonebranch_PROD_task_JOB_A -->|runs_command| n_stonebranch_PROD_command_839f31339ca67757
  n_stonebranch_PROD_trigger_TRG_JOB_A -->|uses_calendar| n_stonebranch_PROD_calendar_BUSINESS_DAYS
  n_stonebranch_PROD_trigger_TRG_JOB_A -->|starts| n_stonebranch_PROD_task_JOB_A
  n_stonebranch_PROD_task_JOB_B -->|depends_on_success| n_stonebranch_PROD_task_JOB_A
  n_stonebranch_PROD_task_JOB_A -->|uses_calendar| n_stonebranch_PROD_calendar_BUSINESS_DAYS
